[
    {
        "article_en": "https://en.wikipedia.org/wiki/Mongol_conquest_of_the_Jin_dynasty",
        "summary_wikipedia": "The Mongol conquest of the Jin dynasty, also known as the Mongol–Jin War, was fought between the Mongol Empire and the Jurchen-led Jin dynasty in Manchuria and North China. The war, which started in 1211, lasted over 23 years and ended with the complete conquest of the Jin dynasty by the Mongols in 1234."
    },
    {
        "article_en": "https://en.wikipedia.org/wiki/Cayuse_War",
        "summary_wikipedia": "The Cayuse War was an armed conflict that took place in the Northwestern United States from 1847 to 1855 between the Cayuse people of the region and the United States Government and local American settlers. Caused in part by the influx of disease and settlers to the region, the immediate start of the conflict occurred in 1847 when the Whitman massacre took place at the Whitman Mission near present-day Walla Walla, Washington when thirteen people were killed in and around the mission. Over the next few years the Provisional Government of Oregon and later the United States Army battled the Native Americans east of the Cascades. This was the first of several wars between the Native Americans and American settlers in that region that would lead to the negotiations between the United States and Native Americans of the Columbia Plateau, creating a number of Indian reservations."
    },
    {
        "article_en": "https://en.wikipedia.org/wiki/Three_Hundred_and_Thirty_Five_Years'_War",
        "summary_wikipedia": "The Three Hundred and Thirty Five Years' War (Dutch: Driehonderdvijfendertigjarige Oorlog, Cornish: Bell a dri hans pymthek warn ugens) was an alleged state of war between the Netherlands and the Isles of Scilly (located off the southwest coast of Great Britain), and its existence is disputed. It is said to have been extended by the lack of a peace treaty for 335 years without a single shot being fired, which would make it one of the world's longest wars, and a bloodless war. Despite the uncertain validity of the declaration of war, and thus uncertainty about whether or not a state of war ever actually existed, peace was finally declared in 1986, bringing an end to any hypothetical war that may have been legally considered to exist."
    },
    {
        "article_en": "https://en.wikipedia.org/wiki/Republic_of_the_Congo_Civil_War_(1997–1999)",
        "summary_wikipedia": "The Second Republic of the Congo Civil War was the second of two ethnopolitical civil conflicts in the Republic of the Congo, beginning on 5 June 1997 and continuing until 29 December 1999. The war served as the continuation of the civil war of 1993–1994 and involved militias representing three political candidates. The conflict ended following the intervention of the Angolan military, which reinstated former president Denis Sassou Nguesso to power."
    },
    {
        "article_en": "https://en.wikipedia.org/wiki/Armagnac–Burgundian_Civil_War",
        "summary_wikipedia": "The Armagnac–Burgundian Civil War was a conflict between two cadet branches of the French royal family – the House of Orléans (Armagnac faction) and the House of Burgundy (Burgundian faction) from 1407 to 1435. It began during a lull in the Hundred Years' War against the English and overlapped with the Western Schism of the papacy."
    },
    {
        "article_en": "https://en.wikipedia.org/wiki/Polish–Muscovite_War_(1605–1618)",
        "summary_wikipedia": ""
    }
]